{
	"first_name": ["Au"],
	"last_name": ["WaiLun"],
	"professional": "Senior PHP Developer | Laravel | CodeIgniter | MySQL | Web Developer",
	"overview": "I am professional native PHP and Wordpress developer with Bachelor degree in Computer Engineering.    I can create custom PHP scripts, REST APIs, Wordpress plugins, Also I have a very good experience with the UI work, I had developed WP plugins as SEO services based on very good knowledge, I can solve issues/errors, Customize/Modify, I can deal with any RDBMS between the following brackets(MYSQL-SQLITE-MONGODB-MARIADB-ORACLE), I can deal with files on server,Read-Write-Delete-Permission(CSV-XML-JSON-PHP-HTML-XLSX, And also I can execute EXE and open command lines),I create custom endpoints for WooCommerce API to be used in hybrid mobile apps, I create custom PHP panels, I can enhance and optimize the speed of the web pages, Test using Gtmetrix and google speed test tool, I can create hybrid apps (ios-apk-appx), I can test security portals , I give full reports and solutions, I have many other skills and tools I am experienced in using them, I can connect company branches together by developing custom desktop apps that uses custom REST API,I can deal with Cpanels for many hosting companies/Create custom file managers if needed/Test execution time of the scripts and reduce the time of the dealing with files on the server.      I have been working with many operating systems including Windows and Linux, intermediate knowledge about JS, HTML5 and CSS3. Task-oriented developer who cares much about time and delivery , dedicated in dealing with the small details which make difference and also quality matters",
	"country": "Germany",
	"hourRate": "30",
	"workXP": [
		{
			"company": "EcomEsteem",
			"role": "Web Developer",
			"description": [
				"Started my career and gained a lot of expertise in the field of Web-development. Created 100+ websites on different platforms.",
				"eCommerce website",
				"Woo-commerce Dropshipping",
				"Shopify Premium Websites."
			],
			"start": "2020.11",
			"end": "2022.5"
		},
		{
			"company": "McKinsey & Company",
			"role": "Fontend Developer | Shopify Developer ",
			"description": [
				"Developed and maintain a high-quality, scalable Shopify store for the client",
				"Collaborate with client to understand their business needs and goals, and provide recommendations on store design and functionality.",
				"Developed scalable applications using the MEAN stack and created POCs for rest service development using Node.js, Express.js, and MongoDB.",
				"Implemented custom features and functionality using HTML5, CSS3, JavaScript, Liquid, and Shopify APIs.",
				"Ensured stores are optimized for SEO and implemented CRO best practices.",
				"Extend Shopify's functionalities to the next level using storefront APIs and meta fields"
			],
			"start": "2019.3",
			"end": "2021.11"
		},
		{
			"company": "BriskCoders",
			"role": "Frontend Developer & Web Designer",
			"description": [
				"Redesigned 10+ websites and logos by using Adobe Photoshop, Flash and Figma.",
				"Developed and launched 2 e-commerce platform and related products online.",
				"Increased mobile orders by 18% by developing a mobile application for ordering and payment.",
				"Gained experience with various web development tools including Bower, NPM, Git, Material design, Gulp, and cloud services like AWS, Azure, GCP, Heroku, and so on."
			],
			"start": "2017.9",
			"end": "2019.2"
		}
	],
	"education": [
		{
			"university": "Technical University of Cologne ",
			"degree": "Bachelor of Computer Science (BCompSc)",
			"field": "Computer Science",
			"start": "2013",
			"end": "2017"
		},
		{
			"university": "The Hong Kong Polythechnic University",
			"degree": "Bachelor of Computer Science (BCompSc)",
			"field": "Computer Science",
			"start": "2011",
			"end": "2013"
		}
	],
	"languages": [],
	"skills": [
        "API Integration",
        "Data Scraping",
        "Page Speed Optimization",
        "PHP",
        "API Development",
        "Plugin Development",
        "AJAX",
        "jQuery",
        "SaaS",
        "Laravel",
        "SQL",
        "Web Application",
        "Custom PHP",
        "Bootstrap",
        "CSS"
	],
	"services": [
		"Web Development",
        "Web & Mobile Design",
        "Ecommerce Development",
		"Data Mining & Management",
		"Database Management & Administration",
		"Desktop Application Development",
		"Blockchain, NFT & Cryptocurrency",
		"Lead Generation & Telemarketing"
	],
	"street": "Rheinuferstrasse 20",
	"birthday": "1999-02-28",
	"zipcode": "51063",
	"city": "Kolenfeld",
	"location": "Germany",
	"phone": "00840442169",
	"avatar": ["001.jpg","002.jpg","003.jpg","004.jpg"]
}